views/layouts/main.php

SELECT COUNT(*) FROM `cart` WHERE `user_key`='90osfmukUSBxUiDJ94bHEBXJWdOTqNRS'
---
                    <li class="nav__item">
                        <a class="nav__link nav__link--cart nav__link--cart-user" id="cart-active">
                            <span class="nav__link-text">Кошик</span>
                            <span class="nav__link-count" id="cart-count"><?= Cart::find()->where(['user_key' => Yii::$app->params['user_key']])->count()?></span>