controllers/ContactController.php

    public function actionIndex()
    {
        $this->layout = 'main';

        $address = Contact::find()->where(['type' => 'Адреса'])->orderBy(['value' => SORT_ASC])->all();
        $email = Contact::find()->where(['type' => 'Електронна адреса'])->orderBy(['value' => SORT_ASC])->all();
        $phone = Contact::find()->where(['type' => 'Телефон'])->orderBy(['value' => SORT_ASC])->all();
        $time = Contact::find()->where(['type' => 'Час роботи'])->orderBy(['value' => SORT_ASC])->all();
        $social = Contact::find()->where(['type' => 'Instagram'])->orWhere(['type' => 'Telegram'])->orWhere(['type' => 'Viber'])->orderBy(['type' => SORT_ASC])->all();
---
SELECT * FROM `contact` WHERE `type`='Адреса' ORDER BY `value`
SELECT * FROM `contact` WHERE `type`='Електронна адреса' ORDER BY `value`
SELECT * FROM `contact` WHERE `type`='Телефон' ORDER BY `value`
SELECT * FROM `contact` WHERE `type`='Час роботи' ORDER BY `value`
SELECT * FROM `contact` WHERE ((`type`='Instagram') OR (`type`='Telegram')) OR (`type`='Viber') ORDER BY `type`