controllers/FavoriteController.php

    public function actionChoose()
    {
        $good_id = Yii::$app->request->post('good_id');
        $user_id = Yii::$app->user->identity->id;
        if (($model = Favorite::findOne(['good_id' => $good_id, 'user_id' => $user_id])) !== null) {
            $model->delete();

            echo 'success delete';
        } else {
            $model = new Favorite();
            $model->user_id = $user_id;
            $model->good_id = $good_id;
            $model->save();
---
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=3)
SELECT * FROM `favorite` WHERE (`good_id`='13') AND (`user_id`=3)
DELETE FROM `favorite` WHERE `id`=1
INSERT INTO `favorite` (`user_id`, `good_id`, `created_at`) VALUES (3, 13, 1702584906)