controllers/ShopController.php

    public function actionIndex()
    {
        $categories = Category::find()->orderBy(['title' => SORT_ASC])->all();
        $genrises = GoodsGenre::find()->orderBy(['value' => SORT_ASC])->groupBy('value')->all();
        $publishers = Goods::find()->where(['hide' => 'Ні'])->orderBy(['publisher' => SORT_ASC])->groupBy('publisher')->all();

        $query = Goods::find()->where(['hide' => 'Ні']);

        $this->actionFilterGoods($query);
        $this->actionSortGoods($query);

        $countQuery = clone $query;
        $pages = new Pagination(['totalCount' => $countQuery->count(), 'pageSize' => 12]);
        $pages->pageSizeParam = false;
        $model = $query
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->all();
---
SELECT * FROM `category` ORDER BY `title`
SELECT * FROM `goods_genre` GROUP BY `value` ORDER BY `value`
SELECT * FROM `goods` WHERE `hide`='Ні' GROUP BY `publisher` ORDER BY `publisher`
SELECT COUNT(*) FROM `goods` WHERE `hide`='Ні'

    public function actionCategory($id)
    {

        if (($category = Category::findOne(['url_key' => $id])) !== null) {
            $category_id = $category->id;

            $good_id = [];
            $goods = Goods::find()->where(['hide' => 'Ні', 'category_id' => $category_id])->all();
            foreach ($goods as $good) {
                array_push($good_id, $good->id);
            }

            $categories = Category::find()->orderBy(['title' => SORT_ASC])->all();
            $genrises = GoodsGenre::find()->where(['good_id' => array_unique($good_id)])->orderBy(['value' => SORT_ASC])->groupBy('value')->all();
            $publishers = Goods::find()->where(['hide' => 'Ні', 'category_id' => $category_id])->orderBy(['publisher' => SORT_ASC])->groupBy('publisher')->all();

            $query = Goods::find()->where(['hide' => 'Ні', 'category_id' => $category_id]);

            $this->actionFilterGoods($query);
            $this->actionSortGoods($query);

            $countQuery = clone $query;
            $pages = new Pagination(['totalCount' => $countQuery->count(), 'pageSize' => 12]);
            $pages->pageSizeParam = false;
            $model = $query
                ->offset($pages->offset)
                ->limit($pages->limit)
                ->all();
---
SELECT * FROM `category` WHERE `url_key`='dytiacha-literatura'
SELECT * FROM `goods` WHERE (`hide`='Ні') AND (`category_id`=3)
SELECT * FROM `category` ORDER BY `title`
SELECT * FROM `goods_genre` WHERE `good_id` IN (2, 5) GROUP BY `value` ORDER BY `value`
SELECT * FROM `goods` WHERE (`hide`='Ні') AND (`category_id`=3) GROUP BY `publisher` ORDER BY `publisher`
SELECT COUNT(*) FROM `goods` WHERE (`hide`='Ні') AND (`category_id`=3)

    public function actionGood($id)
    {
        if (($model = Goods::findOne(['url_key' => $id, 'hide' => 'Ні'])) !== null) {
            $good_characteristics = GoodsCharacteristics::find()->where(['good_id' => $model->id])->orderBy(['id' => SORT_ASC])->all();
            $good_description = GoodsDescription::findOne(['good_id' => $model->id]);
            $good_images = GoodsImages::find()->where(['good_id' => $model->id])->orderBy(['id' => SORT_ASC])->all();

            return $this->render('good', [
                'category' => Category::findOne(['id' => $model->category_id]),
                'subcategory' => Subcategory::findOne(['id' => $model->subcategory_id]),
                'model' => $model,
                'good_characteristics' => $good_characteristics,
                'good_description' => $good_description,
                'good_images' => $good_images,
            ]);
---
SELECT * FROM `goods` WHERE (`url_key`='100-idej-dlja-tvorchih-mam') AND (`hide`='Ні')
SELECT * FROM `goods_characteristics` WHERE `good_id`=13 ORDER BY `id`
SELECT * FROM `goods_description` WHERE `good_id`=13
SELECT * FROM `goods_images` WHERE `good_id`=13 ORDER BY `id`
SELECT * FROM `category` WHERE `id`=6
SELECT * FROM `subcategory` WHERE `id` IS NULL