controllers/SiteController.php

SELECT * FROM `category` ORDER BY rand() LIMIT 3
SELECT * FROM `goods` WHERE `hide`='Ні' ORDER BY `created_at` DESC LIMIT 8
SELECT * FROM `slider`
---
    public function actionIndex()
    {
        $categories = Category::find()->orderBy([new Expression('rand()')])->limit(3)->all();
        $new_goods = Goods::find()->where(['hide' => 'Ні'])->orderBy(['created_at' => SORT_DESC])->limit(8)->all();
        $slider = Slider::find()->all();