controllers/UserController.php

SELECT * FROM `auth_assignment` WHERE `user_id`=3
---
    public function actionProfile()
    {
        $id = Yii::$app->user->id;
        $model = $this->findModel($id);
        $password = new PasswordForm();

        $role = AuthAssignment::findOne(['user_id' => $id])->item_name;

SELECT * FROM `user` WHERE `id`=3
---
    protected function findModel($id)
    {
        if (($model = User::findOne(['id' => $id])) !== null) {