components/PageContentComponent.php

    public function gettingContent() {
        $url = '/' . Yii::$app->controller->id . '/' . Yii::$app->controller->action->id;

        return Content::findOne(['url' => $url]);
---
SELECT * FROM `content` WHERE `url`='/site/index'