widgets/CartWidget.php

SELECT * FROM `cart` WHERE `user_key`='90osfmukUSBxUiDJ94bHEBXJWdOTqNRS'
---
	public function init(){
        parent::init();

        $this->cart = null;
        $this->cart = Cart::find()->where(['user_key' => Yii::$app->params['user_key']])->all();