widgets/CategoryWidget.php

SELECT * FROM `category` ORDER BY `title` LIMIT 4
---
	public function init(){
        parent::init();

        $this->cat = Category::find()
            ->orderBy(['title' => SORT_ASC])
            ->limit(4);

SELECT COUNT(*) FROM `category`
---
	public function run() {
		return $this->render('category/view', [
			'category' => $this->cat->all(),
			'count' => $this->cat->count(),