widgets/ContactWidget.php

SELECT * FROM `contact` WHERE `type`='Телефон'
SELECT * FROM `contact` WHERE `type`='Електронна адреса'
SELECT * FROM `contact` WHERE `type`='Instagram'
---
	public function init(){
        parent::init();

        $this->phone = Contact::findOne(['type' => 'Телефон']);
        $this->email = Contact::findOne(['type' => 'Електронна адреса']);
        $this->instagram = Contact::findOne(['type' => 'Instagram']);