widgets/GoodsWidget.php

SELECT * FROM `goods` WHERE (`hide`='Ні') AND (`id` <> 13) ORDER BY rand() LIMIT 4
---
	public function init(){
        parent::init();

        $this->goods = Goods::find()
            ->where(['hide' => 'Ні'])
            ->andWhere(['<>', 'id', $this->good_id])
            ->orderBy([new Expression('rand()')])
            ->limit(4)
            ->all();