views/site/index.php

                    <?php foreach ($new_goods as $item):
                        $goods_image = 'no-image.png';

                        if (GoodsImages::find()->where(['good_id' => $item->id])->count() > 0) {
                            if (($preview = GoodsImages::findOne(['good_id' => $item->id, 'preview' => 'Так'])) !== null) {
---
SELECT COUNT(*) FROM `goods_images` WHERE `good_id`=13
SELECT * FROM `goods_images` WHERE (`good_id`=13) AND (`preview`='Так')

                        ?>
                        <article class="goods-swiper__slide goods__item swiper-slide">
                            <?php if (!Yii::$app->user->isGuest):
                                $favorite_icon = Favorite::findOne(['good_id' => $item->id, 'user_id' => Yii::$app->user->identity->id]) !== null ? 'bxs-heart' : 'bx-heart'
---
SELECT * FROM `favorite` WHERE (`good_id`=13) AND (`user_id`=3)