views/shop/good.php

        <div class="good__control">
            <a class="good__button<?= $model->available === 'Так' ? '' : ' good__button--disable' ?> button" type="button" data-good-id="<?= $model->id ?>">Придбати</a>
            <?php if (!Yii::$app->user->isGuest):
            $favorite_icon = Favorite::findOne(['good_id' => $model->id, 'user_id' => Yii::$app->user->identity->id]) !== null ? 'bxs-heart' : 'bx-heart'
---
SELECT * FROM `favorite` WHERE (`good_id`=13) AND (`user_id`=3)

        <?php if ($model->genre !== null): ?>
            <div class="good__genre">
                <?php
                $genrises = GoodsGenre::find()->where(['good_id' => $model->id])->orderBy(['value' => SORT_ASC])->all();
---
SELECT * FROM `goods_genre` WHERE `good_id`=13 ORDER BY `value`