views/shop/index.php

SELECT * FROM `subcategory` WHERE `category_id`=6
---
                </li>
                <?php foreach ($categories as $category): ?>
                    <li class="shop__filters-item">
                        <?php if (Subcategory::findOne(['category_id' => $category->id]) !== null): ?>

SELECT COUNT(*) FROM `goods_images` WHERE `good_id`=13
SELECT * FROM `goods_images` WHERE (`good_id`=13) AND (`preview`='Так')
---
                <?php foreach ($model as $item):
                    $goods_image = 'no-image.png';

                    if (GoodsImages::find()->where(['good_id' => $item->id])->count() > 0) {
                        if (($preview = GoodsImages::findOne(['good_id' => $item->id, 'preview' => 'Так'])) !== null) {

SELECT * FROM `favorite` WHERE (`good_id`=13) AND (`user_id`=3)
---
                    ?>
                    <article class="goods__item">
                        <?php if (!Yii::$app->user->isGuest):
                            $favorite_icon = Favorite::findOne(['good_id' => $item->id, 'user_id' => Yii::$app->user->identity->id]) !== null ? 'bxs-heart' : 'bx-heart'