widgets/views/goods/view.php

            <?php foreach ($goods as $item):
                $goods_image = 'no-image.png';

                if (GoodsImages::find()->where(['good_id' => $item->id])->count() > 0) {
                    if (($preview = GoodsImages::findOne(['good_id' => $item->id, 'preview' => 'Так'])) !== null) {
---
SELECT COUNT(*) FROM `goods_images` WHERE `good_id`=3
SELECT * FROM `goods_images` WHERE (`good_id`=3) AND (`preview`='Так')


                <article class="goods__item">
                    <?php if (!Yii::$app->user->isGuest):
                        $favorite_icon = Favorite::findOne(['good_id' => $item->id, 'user_id' => Yii::$app->user->identity->id]) !== null ? 'bxs-heart' : 'bx-heart'
---
SELECT * FROM `favorite` WHERE (`good_id`=3) AND (`user_id`=3)