models/User.php

    public static function findIdentity($id)
    {
        return static::find()->where(['id' => $id])->andWhere(
            [
                'or',
                ['status' => self::STATUS_ACTIVE],
                ['status' => self::STATUS_BANNED]
            ]
        )->one();
---
SELECT * FROM `user` WHERE (`id`=3) AND ((`status`=10) OR (`status`=99))

    public static function findByEmail($email)
    {
        return static::find()->where(['email' => $email])->andWhere(
            [
                'or',
                ['status' => self::STATUS_ACTIVE],
                ['status' => self::STATUS_BANNED]
            ]
        )->one();
---
SELECT * FROM `user` WHERE (`email`='macko@shop.local') AND ((`status`=10) OR (`status`=99))